Revit 2026 API

# FormatOptionsIsValidForSpec Method

---

Checks whether this FormatOptions is valid for a given spec.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidForSpec(
	ForgeTypeId specTypeId
)
```
```vb
Public Function IsValidForSpec (
	specTypeId As ForgeTypeId
) As Boolean
```
```cpp
public:
bool IsValidForSpec(
	ForgeTypeId^ specTypeId
)
```
```fsharp
member IsValidForSpec :
        specTypeId : ForgeTypeId -> bool
```

#### Parameters

specTypeId ForgeTypeId
     Identifier of the spec.

#### Return Value

Boolean True if the FormatOptions is valid, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId). |
| ArgumentNullException | A non-optional argument was null |

The FormatOptions is valid if UseDefault is true or if the unit in the FormatOptions is valid for the spec. See UnitUtils.IsValidUnit(ForgeTypeId, ForgeTypeId) and UnitUtils.GetValidUnits(ForgeTypeId).

#### Reference

FormatOptions Class

Autodesk.Revit.DB Namespace